## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                       |
|----------|--------------------------------------------------|
| update   | `aws_security_group.ecs_tasks`                   |
|          | `module.ai_answers.aws_ecs_service.this`         |
| recreate | `module.ai_answers.aws_ecs_task_definition.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ update in-place
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ destroy and then create replacement
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= read (data resources)
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group.ecs_tasks will be updated in-place
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ resource "aws_security_group" "ecs_tasks" {
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ egress                 = [
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - {
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - cidr_blocks      = []
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - description      = "Allow ECS to talk to the DocumentDB cluster"
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - from_port        = 27017
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - ipv6_cidr_blocks = []
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - prefix_list_ids  = []
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - protocol         = "tcp"
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - security_groups  = [
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  - "sg-04966047bf236b850",
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m13:48:05.679[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - self             = false
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - to_port          = 27017
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged element hidden)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        id                     = "sg-085c606383f33733e"
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        name                   = "ai-answers-security-group"
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                   = {
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "CostCentre" = "ai-answers-staging"
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (8 unchanged attributes hidden)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.data.aws_ecs_task_definition.this_latest will be read during apply
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (depends on a resource or a module with changes pending)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= data "aws_ecs_task_definition" "this_latest" {
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                      = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn_without_revision     = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + container_definitions    = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cpu                      = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_fault_injection   = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ephemeral_storage        = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + execution_role_arn       = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + family                   = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                       = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + inference_accelerator    = (known after apply)
[0;90m13:48:05.680[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipc_mode                 = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + memory                   = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_mode             = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + pid_mode                 = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + placement_constraints    = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + proxy_configuration      = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + requires_compatibilities = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revision                 = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + runtime_platform         = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + status                   = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + task_definition          = "ai-answers-task"
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + task_role_arn            = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + volume                   = (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_ecs_service.this will be updated in-place
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ resource "aws_ecs_service" "this" {
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        id                                 = "arn:aws:ecs:ca-central-1:992382783569:service/ai-answers-cluster/ai-answers-app-service"
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        name                               = "ai-answers-app-service"
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                               = {
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "CostCentre" = "ai-answers-staging"
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Terraform"  = "true"
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ task_definition                    = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task:9" -> (known after apply)
[0;90m13:48:05.681[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (16 unchanged attributes hidden)
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (4 unchanged blocks hidden)
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_ecs_task_definition.this must be replaced
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_ecs_task_definition" "this" {
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                      = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task:7" -> (known after apply)
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task" -> (known after apply)
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ container_definitions    = jsonencode(
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          ~ [
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              ~ {
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  - environment            = []
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    name                   = "ai-answers"
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  ~ secrets                = [
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + {
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + name      = "MONGODB_URI"
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + valueFrom = ""
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        },
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        {
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                            name      = "OPENAI_API_KEY"
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                            valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/openai_api_key"
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        },
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    ]
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    # (9 unchanged attributes hidden)
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                },
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ] # forces replacement
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m13:48:05.682[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ enable_fault_injection   = false -> (known after apply)
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                       = "ai-answers-task" -> (known after apply)
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ revision                 = 7 -> (known after apply)
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                     = {
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "CostCentre" = "ai-answers-staging"
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Terraform"  = "true"
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (12 unchanged attributes hidden)
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged block hidden)
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 1 to add, 2 to change, 1 to destroy.
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m13:48:05.683[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
